# Это пример скрипта на Python.

# Нажмите Shift+F10, чтобы выполнить его или заменить своим кодом.
# Нажмите Двойное нажатие Shift, чтобы искать везде: классы, файлы, окна инструментов, действия и настройки.


def print_hi(name):
    # Используйте точку останова в строке кода ниже, чтобы отладить скрипт.
    print(f'Hi, {name}')  # Нажмите Ctrl+F8, чтобы переключить точку останова.


# Нажмите зеленую кнопку на поле, чтобы запустить скрипт.
if __name__ == '__main__':
    print_hi('PyCharm')

# См. справку PyCharm на https://www.jetbrains.com/help/pycharm/
